Repository: Clear-Bible/eng-tpi-tm
Catalog: output.tmx
Source language: en_us
Languages: tpi

source: tenth rate
tpi: nambaten

source: terrible
tpi: nambaten

source: testicles
tpi: bol

source: than
tpi: long

source: thank you
tpi: tenkyu

source: that
tpi: olsem

source: that's all
tpi: em tasol

source: theatre
tpi: haus piksa

source: theft
tpi: stil

source: their
tpi: bilong ol

source: then
tpi: dispela taim

source: there
tpi: long hap

source: there is
tpi: i gat

source: they
tpi: ol

source: thick
tpi: strong

source: thief
tpi: stilman

source: thigh
tpi: mit bilong lek

source: thin
tpi: bun nating

source: thing
tpi: samting

source: think
tpi: ting

source: third
tpi: namba tri

source: thirsty
tpi: hangre long dring

source: this
tpi: dispela

source: those
tpi: emtupela

source: thoughts
tpi: tingting

source: thread
tpi: tret

source: three
tpi: tri

source: throat
tpi: nek

source: through
tpi: long namel long

source: throw
tpi: tromoi

source: throw away
tpi: rausim

source: thunder
tpi: klaut i pairap

source: Thursday
tpi: Fonde

source: ticket
tpi: tiket

source: tide
tpi: tait

source: tie
tpi: nektait

source: tighten
tpi: taitim

source: tilapia
tpi: makao

source: time
tpi: taim

source: timetable
tpi: taimtebol

source: tinea
tpi: grile

source: tip
tpi: kapsaitim

source: tired
tpi: les

source: to
tpi: long

source: toast
tpi: tos

source: tobacco
tpi: brus

source: today
tpi: tede

source: toe
tpi: pinga bilong lek

source: together
tpi: wantaim

source: toilet
tpi: smol haus

source: tomahawk
tpi: tamiok

source: tomatoe
tpi: tomato

source: tomorrow
tpi: tumaro

source: tongue
tpi: tang

source: tonight
tpi: tunait

source: too
tpi: tumas

source: tooth
tpi: tit

source: toothache
tpi: tit i pen

source: toothbrush
tpi: bros bilong tit

source: toothpaste
tpi: sop bilong tit

source: torch
tpi: sutlam

source: totem
tpi: pisin

source: touch
tpi: pilim

source: tour
tpi: wokabaut

source: tourist
tpi: turis

source: towel
tpi: taul

source: tower
tpi: taua

source: town
tpi: taun

source: track
tpi: liklik rot

source: tracked vehicle
tpi: senka

source: tradition of ancestors
tpi: tok bilong ol tumbuna

source: train
tpi: tren

source: translate
tpi: tanim tok ples

source: travel
tpi: wokabaut

source: traveling companion
tpi: wanwokabaut

source: tree
tpi: diwai

source: trench
tpi: baret

source: tributary
tpi: hanwara

source: trip
tpi: wokabaut

source: trouble
tpi: trabel

source: troublemaker
tpi: trabelman

source: trousers
tpi: trausis

source: truck
tpi: trak

source: true
tpi: tru

source: truth
tpi: tok tru

source: try
tpi: traim

source: try on
tpi: traim

source: Tuesday
tpi: Tunde

source: tune
tpi: nek

source: turn
tpi: tanim

source: turtle
tpi: trosel

source: twenty
tpi: twenti

source: twice
tpi: tupela taim

source: two
tpi: tu

source: type
tpi: taipim

source: typewriter
tpi: taipraita

source: typist
tpi: taipis

source: tyre
tpi: taia

source: ugly
tpi: i no naispela

source: umbrella
tpi: ambrela

source: unable to
tpi: no inap

source: uncle
tpi: kandere

source: under
tpi: ananit

source: underneath
tpi: ananit

source: understand
tpi: save

source: unemployed
tpi: stap nating

source: unfortunate
tpi: tarangu

source: unite
tpi: bung wantaim

source: university
tpi: yunivesiti

source: unlock door
tpi: lusim dua

source: unmarried
tpi: no marit

source: until
tpi: inap long

source: up
tpi: antap

source: upstairs
tpi: antap

source: urgently
tpi: kwiktaim

source: urinate
tpi: pispis

source: use
tpi: yusim

source: useless
tpi: nogut

source: usually
tpi: save

source: utility
tpi: hapka

source: vagrant
tpi: dripman

source: vague
tpi: karamapim tok

source: valley
tpi: ples i go daun

source: valuable
tpi: i kastim planti mani

source: valve stem on inner tube
tpi: maus bilong gumi

source: various kinds of
tpi: kainkain

source: veal
tpi: mit bilong pikinini bulmakau

source: vegetables
tpi: kumu

source: vein
tpi: mambu bilong blut

source: very
tpi: tumas

source: videorecorder
tpi: vidiorikoda

source: view
tpi: ples lukluk

source: village
tpi: ples

source: vine
tpi: rop

source: visit
tpi: go lukim

source: voice
tpi: nek

source: vomit
tpi: traut

source: vote
tpi: vot

source: voyage
tpi: wokabaut long sip

source: wages
tpi: pe

source: wait for
tpi: wetim

source: waiter
tpi: weta

source: walk
tpi: wokabaut

source: wall
tpi: banis

source: wallaby
tpi: sikau

source: wanderer
tpi: welman

source: want
tpi: laik

source: war
tpi: pait

source: warrior
tpi: man bilong pait

source: was
tpi: bin

source: wash
tpi: wasim

source: washbasin
tpi: dis bilong waswas

source: washer
tpi: ring

source: waste
tpi: westim

source: watch
tpi: hanwas

source: water
tpi: wara

source: way
tpi: rot

source: we
tpi: mipela

source: weary
tpi: les

source: weather
tpi: taim

source: Wednesday
tpi: Trinde

source: weed
tpi: klinim gaden

source: week
tpi: wik

source: weekend
tpi: wiken

source: weigh
tpi: skel

source: well
tpi: gut

source: west
tpi: wes

source: wet
tpi: i gat wara

source: wet season
tpi: taim bilong ren

source: wharf
tpi: bris

source: what
tpi: wanem

source: wheel
tpi: wil

source: when
tpi: wataim or wanem taim

source: where
tpi: we

source: which
tpi: wanem

source: white
tpi: wait

source: who
tpi: usat

source: whore
tpi: pamuk meri

source: whose
tpi: bilong usat

source: why
tpi: bilong wanem

source: wide
tpi: brait

source: wife
tpi: meri

source: wild
tpi: wel

source: will
tpi: bai

source: win
tpi: winim

source: wind
tpi: win

source: window
tpi: windua

source: windpipe
tpi: mambu bilong nek

source: windscreen
tpi: winskrin

source: wine
tpi: wain

source: wing
tpi: han bilong pisin

source: wink
tpi: pasim ai

source: wireless
tpi: wailis

source: wise
tpi: i save tumas

source: witchcraft
tpi: sanguma

source: with
tpi: wantaim

source: withdraw
tpi: autim

source: without
tpi: i no gat

source: woman
tpi: meri

source: wonder
tpi: tingim . . .

source: wonderful
tpi: nais tumas

source: wood
tpi: diwai

source: wool
tpi: gras bilong sipsip

source: word
tpi: tok

source: work
tpi: wok

source: workday
tpi: de bilong wok

source: worker
tpi: wokman

source: workman
tpi: wokman

source: workshop
tpi: woksop

source: world
tpi: graun

source: worn out
tpi: bakarap

source: worries
tpi: wari

source: worry
tpi: wari

source: worse
tpi: moa nogut

source: worship
tpi: lotu

source: worst
tpi: nambawan nogut

source: worth
tpi: kastim

source: wound
tpi: sua

source: wound heals
tpi: sua i drai

source: wreck
tpi: spoilim

source: write
tpi: raitim

source: wrong
tpi: kranki

source: yam
tpi: mami

source: year
tpi: yia

source: yeast
tpi: yis

source: yellow
tpi: yelo

source: yes
tpi: ya

source: yesterday
tpi: asde

source: you
tpi: yu

source: young
tpi: yangpela

source: your
tpi: bilong yu

source: zero
tpi: siro
